In [7]:
# pandas equivalent of SQL statements

import pandas as pd
import numpy as np

In [16]:
df = pd.DataFrame({
    "id" : [1,2,3,4,5],
    "name" : ["Batman", "Alfred", "Robin", "Joker", "Scarecrow"],
    "language" : ["C", "C++", "Python", "C", "ASM"],
    "salary" : [10000000, 100000, 950000, 65000000, 80000],
    "year" : [2000, 1997, 2020, 2000, 2003] 
})

In [17]:
# SQL: SELECT * FROM DATASET

df

   id       name language    salary  year
0   1     Batman        C  10000000  2000
1   2     Alfred      C++    100000  1997
2   3      Robin   Python    950000  2020
3   4      Joker        C  65000000  2000
4   5  Scarecrow      ASM     80000  2003

In [18]:
# SQL: SELECT x,y FROM DATASET

df[["id", "language"]]

   id language
0   1        C
1   2      C++
2   3   Python
3   4        C
4   5      ASM

In [19]:
# where filtering
# SQL: SELECT * FROM dataset WHERE name = "batman"

df[df.language == "C"]

   id    name language    salary  year
0   1  Batman        C  10000000  2000
3   4   Joker        C  65000000  2000

In [20]:
# multiple condition filtering
# SQL: WHERE id = 1 and dept = "IT"

df[(df.language == "C") & (df.id == 1)]

   id    name language    salary  year
0   1  Batman        C  10000000  2000